import type { JSX } from 'vue/jsx-runtime'

export function ChromeStore() {
  return <UIcon class="size-12" name="i-logos-chrome-web-store" />
}

export function EdgeStore() {
  return <UIcon class="size-12" name="i-logos-microsoft-edge" />
}

export function FirefoxStore() {
  return <UIcon class="size-12" name="i-logos-firefox" />
}

export function CrxStore() {
  return (
    <svg
      viewBox="0 0 1024 1024"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      p-id="9154"
      width="48"
      height="48"
    >
      <path
        d="M144.725333 180.224C239.616 75.093333 368.64 17.066667 510.634667 17.066667c178.176 0 339.968 93.525333 428.714666 245.76H548.864c-61.44 0-105.813333 2.048-152.917333 26.624-51.882667 27.306667-92.842667 73.728-115.370667 128.341333L144.725333 180.224z"
        fill="#EA4335"
        p-id="9155"
      ></path>
      <path
        d="M510.634667 34.133333c161.792 0 309.248 79.872 397.994666 211.626667H548.864c-64.170667 0-109.909333 2.048-160.426667 28.672-45.056 23.893333-83.285333 62.122667-108.544 107.178667L165.888 182.954667C256.682667 86.698667 378.197333 34.133333 510.634667 34.133333m0-34.133333C369.322667 0 227.328 58.026667 123.562667 178.176l161.792 281.258667c15.701333-67.584 60.074667-124.928 118.784-155.648 44.373333-23.210667 86.016-24.576 144.725333-24.576h419.157333C874.496 96.938667 693.589333 0 510.634667 0z"
        fill="#504C23"
        p-id="9156"
      ></path>
      <path
        d="M512 512m-152.917333 0a152.917333 152.917333 0 1 0 305.834666 0 152.917333 152.917333 0 1 0-305.834666 0Z"
        fill="#4285F4"
        p-id="9157"
        data-spm-anchor-id="a313x.search_index.0.i2.7a453a81XvBrFa"
      ></path>
      <path
        d="M512 376.149333a135.7824 135.7824 0 1 1 0 271.701334C436.906667 647.850667 375.466667 587.093333 375.466667 512s61.44-135.850667 136.533333-135.850667m0-34.133333c-94.208 0-170.666667 75.776-170.666667 169.984s76.458667 169.984 170.666667 169.984S681.984 605.525333 681.984 512 605.525333 342.016 512 342.016z"
        fill="#504C23"
        p-id="9158"
      ></path>
      <path
        d="M404.138667 995.328c-157.696-34.816-283.989333-139.946667-347.477334-290.133333C-4.096 561.834667 6.144 399.36 82.602667 266.24l212.309333 368.64c47.104 80.554667 125.610667 126.976 215.722667 126.976a274.978133 274.978133 0 0 0 33.450666-2.048l-139.946666 235.52z"
        fill="#34A853"
        p-id="9159"
      ></path>
      <path
        d="M83.285333 301.056L279.893333 643.072c49.834667 86.016 133.802667 135.850667 230.058667 135.850667h2.048l-116.053333 196.608c-70.997333-17.749333-135.168-49.834667-190.464-96.256-57.344-48.469333-103.765333-110.592-133.12-180.906667-54.613333-129.024-49.834667-273.749333 10.922666-397.312m0-68.266667c-196.608 301.056-27.306667 712.021333 329.728 781.653334l165.205334-279.210667c-21.845333 6.826667-45.056 9.557333-67.584 9.557333-76.458667 0-153.6-37.546667-200.704-118.784L83.285333 232.789333z m494.933334 501.76c-0.682667 0-0.682667 0 0 0z"
        fill="#504C23"
        p-id="9160"
      ></path>
      <path
        d="M509.269333 1006.933333l218.453334-370.005333c51.882667-89.429333 43.008-198.656-19.114667-277.845333h273.749333c49.152 150.186667 24.576 309.248-66.901333 438.954666-94.208 133.12-240.981333 208.896-402.773333 208.896h-3.413334z"
        fill="#FBBC05"
        p-id="9161"
      ></path>
      <path
        d="M970.069333 376.149333c42.325333 141.312 17.749333 290.133333-68.266666 412.330667-85.333333 120.832-216.405333 193.194667-361.813334 201.386667l202.752-343.381334c49.152-86.016 47.104-188.416-1.365333-269.653333h228.693333m24.576-34.816H669.696c79.189333 73.728 96.938667 192.512 43.008 286.72l-232.789333 394.581333c10.922667 0.682667 21.845333 0.682667 32.768 0.682667 350.890667 0 599.381333-348.842667 481.962666-681.984z"
        fill="#504C23"
        p-id="9162"
      ></path>
    </svg>
  )
}

export function Github() {
  return (
    <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 12 12">
      <path
        fill="currentColor"
        d="M6 0a6 6 0 1 1 0 12A6 6 0 0 1 6 0m0 .98C3.243.98 1 3.223 1 6a5.02 5.02 0 0 0 3.437 4.77l.045.005c.203.01.279-.129.279-.25l-.007-.854c-1.39.303-1.684-.674-1.684-.674c-.227-.58-.555-.734-.555-.734c-.454-.312.034-.306.034-.306c.365.026.604.288.708.43l.058.088c.446.767 1.17.546 1.455.418c.046-.325.174-.546.317-.672c-1.11-.127-2.277-.558-2.277-2.482c0-.548.195-.996.515-1.348l-.03-.085c-.064-.203-.152-.658.079-1.244l.04-.007c.124-.016.548-.013 1.335.522A4.8 4.8 0 0 1 6 3.408c.425.002.853.058 1.252.17c.955-.65 1.374-.516 1.374-.516c.272.692.1 1.202.05 1.33c.32.35.513.799.513 1.347c0 1.93-1.169 2.354-2.283 2.478c.18.155.34.462.34.93l-.006 1.378c0 .13.085.282.323.245A5.02 5.02 0 0 0 11 6C11 3.223 8.757.98 6 .98"
      />
    </svg>
  )
}

export const store: Record<string, [() => JSX.Element, string, string, string]> = {
  chrome: [
    ChromeStore,
    'Chrome Store, 需要魔法，审核速度较慢',
    'https://chromewebstore.google.com/detail/ogkmgjbagackkdlcibcailacnncgonbn?authuser=1&hl=zh-CN',
    'https://img.shields.io/chrome-web-store/v/ogkmgjbagackkdlcibcailacnncgonbn?label=',
  ],
  crx: [
    CrxStore,
    '国内Chrome用户推荐，Chrome 同步无需魔法，更新速度未知',
    'https://www.crxsoso.com/webstore/detail/ogkmgjbagackkdlcibcailacnncgonbn',
    'https://img.shields.io/badge/v%3F.%3F.%3F-EF7C3D',
  ],
  edge: [
    EdgeStore,
    'Edge浏览器用户推荐，除了更新慢一些。审核速度最慢',
    'https://microsoftedge.microsoft.com/addons/detail/jcllnbjfeamhihjpfjlclhdnjmggbgal',
    'https://img.shields.io/badge/dynamic/json?url=https%3A%2F%2Fmicrosoftedge.microsoft.com%2Faddons%2Fgetproductdetailsbycrxid%2Fjcllnbjfeamhihjpfjlclhdnjmggbgal&query=version&prefix=v&label=&color=EF7C3D',
  ],
  firefox: [
    FirefoxStore,
    'Firefox 浏览器用户，无需魔法, 审核速度最快',
    'https://addons.mozilla.org/zh-CN/firefox/addon/boss-helper/',
    'https://img.shields.io/amo/v/boss-helper?label=',
  ],
  github: [
    Github,
    'Github, 需要魔法，没有审核，随时更新',
    'https://github.com/Ocyss/boss-helper/releases/latest',
    'https://img.shields.io/github/v/release/Ocyss/boss-helper?label=',
  ],
}
